;Place localized text in this file
[Hitman X2SoldierClassTemplate]

DisplayName="Hitman"
ClassSummary="At home in the city, the Hitman carries only easily concealable weapons, so that he can easily disappear into the bustle of street life. Skilled at close quarters engagements, the Hitman is trouble for any who attempt to close with them."

AbilityTreeTitles[0]="Padfoot"
AbilityTreeTitles[1]="Gunman"
AbilityTreeTitles[2]="Bruiser"
AbilityTreeTitles[3]="Xcom"
AbilityTreeTitles[4]="Pistols"

RandomNickNames[0]="Ace"
RandomNickNames[1]="Agent"
RandomNickNames[2]="Backhand"
RandomNickNames[3]="Beatdown"
RandomNickNames[4]="Blackout"
RandomNickNames[5]="Bone Breaker"
RandomNickNames[6]="Cold Blooded"
RandomNickNames[7]="Conman"
RandomNickNames[8]="Cryptkeeper"
RandomNickNames[9]="Death"
RandomNickNames[10]="Dervish"
RandomNickNames[11]="Doom"
RandomNickNames[12]="Dragon"
RandomNickNames[13]="Effigy"
RandomNickNames[14]="Evil Genius"
RandomNickNames[15]="Fallen Angel"
RandomNickNames[16]="Fireman"
RandomNickNames[17]="Gear"
RandomNickNames[18]="Hypnos"
RandomNickNames[19]="Ifrit"
RandomNickNames[20]="Jackknife"
RandomNickNames[21]="Jet"
RandomNickNames[22]="Lights Out"
RandomNickNames[23]="Magus"
RandomNickNames[24]="Minute"
RandomNickNames[25]="Monster"
RandomNickNames[26]="One-Eye"
RandomNickNames[27]="Pitfall"
RandomNickNames[28]="Pox"
RandomNickNames[29]="Rainmaker"
RandomNickNames[30]="Rattlesnake"
RandomNickNames[31]="Rebound"
RandomNickNames[32]="Red Death"
RandomNickNames[33]="Rise"
RandomNickNames[34]="Ripper"
RandomNickNames[35]="Salamander"
RandomNickNames[36]="Scream"
RandomNickNames[37]="Sendoff"
RandomNickNames[38]="Shade"
RandomNickNames[39]="Shakedown"
RandomNickNames[40]="Searing"
RandomNickNames[41]="Shifty"
RandomNickNames[42]="Shooter"
RandomNickNames[43]="Snake"
RandomNickNames[44]="Soul Taker"
RandomNickNames[45]="Spectral"
RandomNickNames[46]="Spit Break"
RandomNickNames[47]="Tactical"
RandomNickNames[48]="Teardrop"
RandomNickNames[49]="Terror"
RandomNickNames[50]="Tombstone"
RandomNickNames[51]="Venomous"
RandomNickNames[52]="Viper"
RandomNickNames[53]="Wiseman"
RandomNickNames[54]="Wonderland"
RandomNickNames[55]="Wrath"
RandomNickNames[56]="Yeoman"
RandomNickNames[57]="Zero"
;ALPHABETICAL ORDER
RandomNickNames_Male[0]="Demon King"
RandomNickNames_Male[1]="Firstborn"
RandomNickNames_Male[2]="Overlord"
RandomNickNames_Male[3]="Wizard"
RandomNickNames_Female[0]="Ember"
RandomNickNames_Female[1]="Empress"
RandomNickNames_Female[2]="Witch"
RandomNickNames_Female[3]="Sorceress"
;ALPHABETICAL ORDER

PhotoboothSoloBLines_Male[0]="He's always in the thick of things."
PhotoboothSoloBLines_Male[1]="Robbing ADVENT of their lives!"
PhotoboothSoloBLines_Male[2]="One quick slice is all he needs."
PhotoboothSoloBLines_Male[3]="You'll never see him coming."

PhotoboothSoloBLines_Female[0]="She's always in the thick of things."
PhotoboothSoloBLines_Female[1]="Robbing ADVENT of their lives!"
PhotoboothSoloBLines_Female[2]="One quick slice is all she needs."
PhotoboothSoloBLines_Female[3]="You'll never see her coming."

